Revit 2026 API

# ValidateCurveLoopsOptions Properties

---

The ValidateCurveLoopsOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ValidateCurveLoopsOptions Class

Autodesk.Revit.DB Namespace